## panda data structuers

In [2]:
import numpy as np
import pandas as pd

## creating a series

In [4]:
labels=['A','B','C']
list_1=['a','b','c']
num=[20,3,40]
dict_1={'a':10,'b':3,'c':40}
arr1=np.array(['kenan','Alaa','fouad'])

In [5]:
ser_1=pd.Series(data=list_1)
ser_1

0    a
1    b
2    c
dtype: object

In [6]:
ser_2=pd.Series(num)
ser_2

0    20
1     3
2    40
dtype: int64

In [8]:
ser_3=pd.Series(dict_1)
ser_3

a    10
b     3
c    40
dtype: int64

In [9]:
ser_4=pd.Series(arr1)
ser_4

0    kenan
1     Alaa
2    fouad
dtype: object

In [10]:
ser_5 =pd.Series(arr1 , index=labels)
ser_5

A    kenan
B     Alaa
C    fouad
dtype: object

In [11]:
ser6 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])  
ser6

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [12]:
ser6['Germany']

2

In [13]:
ser7 = pd.Series(['USA', 'Germany','Italy', 'Japan'],index = [1,2,5,4])
ser7

1        USA
2    Germany
5      Italy
4      Japan
dtype: object

In [14]:
ser7

1        USA
2    Germany
5      Italy
4      Japan
dtype: object

## Data frame

In [16]:
from numpy.random import randn
np.random.seed(42)
df1=randn(5,4)
df1

array([[ 0.49671415, -0.1382643 ,  0.64768854,  1.52302986],
       [-0.23415337, -0.23413696,  1.57921282,  0.76743473],
       [-0.46947439,  0.54256004, -0.46341769, -0.46572975],
       [ 0.24196227, -1.91328024, -1.72491783, -0.56228753],
       [-1.01283112,  0.31424733, -0.90802408, -1.4123037 ]])

In [17]:
df = pd.DataFrame(randn(5,4),index='1 2 3 4 5'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
1  1.465649 -0.225776  0.067528 -1.424748
2 -0.544383  0.110923 -1.150994  0.375698
3 -0.600639 -0.291694 -0.601707  1.852278
4 -0.013497 -1.057711  0.822545 -1.220844
5  0.208864 -1.959670 -1.328186  0.196861

In [18]:
df[['W','Y']]

          W         Y
1  1.465649  0.067528
2 -0.544383 -1.150994
3 -0.600639 -0.601707
4 -0.013497  0.822545
5  0.208864 -1.328186

In [19]:
df['X']

1   -0.225776
2    0.110923
3   -0.291694
4   -1.057711
5   -1.959670
Name: X, dtype: float64

In [20]:
df.iloc[0]

W    1.465649
X   -0.225776
Y    0.067528
Z   -1.424748
Name: 1, dtype: float64

In [21]:
df.loc['2']

W   -0.544383
X    0.110923
Y   -1.150994
Z    0.375698
Name: 2, dtype: float64

In [22]:
df.loc[['1','4']]

          W         X         Y         Z
1  1.465649 -0.225776  0.067528 -1.424748
4 -0.013497 -1.057711  0.822545 -1.220844

In [23]:
df.iloc[[1,2]]

          W         X         Y         Z
2 -0.544383  0.110923 -1.150994  0.375698
3 -0.600639 -0.291694 -0.601707  1.852278

In [24]:
df['new']=df['X']+df['Z']
df

          W         X         Y         Z       new
1  1.465649 -0.225776  0.067528 -1.424748 -1.650524
2 -0.544383  0.110923 -1.150994  0.375698  0.486621
3 -0.600639 -0.291694 -0.601707  1.852278  1.560584
4 -0.013497 -1.057711  0.822545 -1.220844 -2.278555
5  0.208864 -1.959670 -1.328186  0.196861 -1.762809

In [25]:
##df.drop('X'),axis=1,inplace=True)

In [26]:
df

          W         X         Y         Z       new
1  1.465649 -0.225776  0.067528 -1.424748 -1.650524
2 -0.544383  0.110923 -1.150994  0.375698  0.486621
3 -0.600639 -0.291694 -0.601707  1.852278  1.560584
4 -0.013497 -1.057711  0.822545 -1.220844 -2.278555
5  0.208864 -1.959670 -1.328186  0.196861 -1.762809

In [27]:
df.loc[['2','5'],['Y','X']]

          Y         X
2 -1.150994  0.110923
5 -1.328186 -1.959670

In [28]:
df>0

       W      X      Y      Z    new
1   True  False   True  False  False
2  False   True  False   True   True
3  False  False  False   True   True
4  False  False   True  False  False
5   True  False  False   True  False

In [29]:
df[df>0]

          W         X         Y         Z       new
1  1.465649       NaN  0.067528       NaN       NaN
2       NaN  0.110923       NaN  0.375698  0.486621
3       NaN       NaN       NaN  1.852278  1.560584
4       NaN       NaN  0.822545       NaN       NaN
5  0.208864       NaN       NaN  0.196861       NaN

In [30]:
df[df['new']>1]

          W         X         Y         Z       new
3 -0.600639 -0.291694 -0.601707  1.852278  1.560584

In [31]:
df[df['X']>0][['W','Y']]

          W         Y
2 -0.544383 -1.150994

In [32]:
df[(df['X']<0) & (df['new']<1) &(df['Y']>0)]

          W         X         Y         Z       new
1  1.465649 -0.225776  0.067528 -1.424748 -1.650524
4 -0.013497 -1.057711  0.822545 -1.220844 -2.278555

In [33]:
df[(df['X']<0) | (df['new']<1)]

          W         X         Y         Z       new
1  1.465649 -0.225776  0.067528 -1.424748 -1.650524
2 -0.544383  0.110923 -1.150994  0.375698  0.486621
3 -0.600639 -0.291694 -0.601707  1.852278  1.560584
4 -0.013497 -1.057711  0.822545 -1.220844 -2.278555
5  0.208864 -1.959670 -1.328186  0.196861 -1.762809

In [34]:
df.reset_index()

  index         W         X         Y         Z       new
0     1  1.465649 -0.225776  0.067528 -1.424748 -1.650524
1     2 -0.544383  0.110923 -1.150994  0.375698  0.486621
2     3 -0.600639 -0.291694 -0.601707  1.852278  1.560584
3     4 -0.013497 -1.057711  0.822545 -1.220844 -2.278555
4     5  0.208864 -1.959670 -1.328186  0.196861 -1.762809

In [35]:
newind='CA NY WY OR CO'.split()

In [36]:
df['states']=newind
df

          W         X         Y         Z       new states
1  1.465649 -0.225776  0.067528 -1.424748 -1.650524     CA
2 -0.544383  0.110923 -1.150994  0.375698  0.486621     NY
3 -0.600639 -0.291694 -0.601707  1.852278  1.560584     WY
4 -0.013497 -1.057711  0.822545 -1.220844 -2.278555     OR
5  0.208864 -1.959670 -1.328186  0.196861 -1.762809     CO

In [37]:
df.set_index('states',inplace=True)

In [38]:
df

               W         X         Y         Z       new
states
CA      1.465649 -0.225776  0.067528 -1.424748 -1.650524
NY     -0.544383  0.110923 -1.150994  0.375698  0.486621
WY     -0.600639 -0.291694 -0.601707  1.852278  1.560584
OR     -0.013497 -1.057711  0.822545 -1.220844 -2.278555
CO      0.208864 -1.959670 -1.328186  0.196861 -1.762809

In [39]:
df.reset_index(inplace=True)
df

  states         W         X         Y         Z       new
0     CA  1.465649 -0.225776  0.067528 -1.424748 -1.650524
1     NY -0.544383  0.110923 -1.150994  0.375698  0.486621
2     WY -0.600639 -0.291694 -0.601707  1.852278  1.560584
3     OR -0.013497 -1.057711  0.822545 -1.220844 -2.278555
4     CO  0.208864 -1.959670 -1.328186  0.196861 -1.762809

## missing Values

In [41]:
dict_2={'A':[1,2,np.nan],
                  'B':[np.nan,np.nan,5],
                  'C':[1,2,3]}

In [42]:
df1=pd.DataFrame(dict_2)
df1

     A    B  C
0  1.0  NaN  1
1  2.0  NaN  2
2  NaN  5.0  3

In [43]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       1 non-null      float64
 2   C       3 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 204.0 bytes

In [44]:
df1.isna()

       A      B      C
0  False   True  False
1  False   True  False
2   True  False  False

In [45]:
df1.isnull()

       A      B      C
0  False   True  False
1  False   True  False
2   True  False  False

In [46]:
df1.dropna(thresh=2)

     A    B  C
0  1.0  NaN  1
1  2.0  NaN  2
2  NaN  5.0  3

In [47]:
df1.dropna(axis=1)

   C
0  1
1  2
2  3

In [48]:
df1.fillna(value='fill_value')     ##df.fillna(value=20)

            A           B  C
0         1.0  fill_value  1
1         2.0  fill_value  2
2  fill_value         5.0  3

In [49]:
df1['A'].fillna(df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [50]:
df1['B'].fillna(df1['B'].median(),inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_3448\2689805704.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['B'].fillna(df1['B'].median(),inplace=True)

In [51]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  NaN  5.0  3

## groupby

In [107]:
data2 = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [109]:
df2=pd.DataFrame(data2)

In [121]:
df2

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [129]:
by_comp=df2.groupby('Company')['Sales'].sum()
by_comp

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64

In [137]:
by_comp=df2.groupby('Company')['Sales'].min()
by_comp

Company
FB      243
GOOG    120
MSFT    124
Name: Sales, dtype: int64

In [139]:
by_comp=df2.groupby('Company')['Sales'].std()
by_comp

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [142]:
by_comp=df2.groupby('Company')['Sales'].mean()
by_comp

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [144]:
df2.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [146]:
df2

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [150]:
FB=df2[df2['Company']=='FB']
FB

  Company Person  Sales
4      FB   Carl    243
5      FB  Sarah    350

In [154]:
sum_sales_FB=FB['Sales'].sum()
sum_sales_FB

593

In [156]:
FB.describe()

            Sales
count    2.000000
mean   296.500000
std     75.660426
min    243.000000
25%    269.750000
50%    296.500000
75%    323.250000
max    350.000000

In [158]:
MSFT=df2[df2['Company']=='MSFT']
MSFT

  Company   Person  Sales
2    MSFT      Amy    340
3    MSFT  Vanessa    124

In [162]:
MSFT=MSFT['Sales'].sum()
MSFT

464

In [160]:
df2.shape

(6, 3)

In [166]:
df2.tail(3)

  Company   Person  Sales
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350